note/2018/easy-bindings-when-region-is-active/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-15 Thu 19:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Easy Bindings when Region Is Active</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Easy Bindings when Region Is Active</h1>
<p>
In Emacs, "region active" means <code>transient-mark-mode</code> is on, which roughly means you selected some text.
In this state, you can bind some "easy" bindings, i.e., bindings without modifiers.
These easy bindings can greatly improve your text editing experience. Here is what I binded:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Operation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left"><code>yank</code> (paste)</td>
</tr>

<tr>
<td class="org-left"><code>y</code></td>
<td class="org-left"><code>kill-ring-save</code> (copy)</td>
</tr>

<tr>
<td class="org-left"><code>C-y</code></td>
<td class="org-left"><code>kill-ring-save</code> (copy)</td>
</tr>

<tr>
<td class="org-left"><code>Y</code></td>
<td class="org-left">(copy but don't exist <code>transient-mark-mode</code>)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left"><code>isolate-quick-add</code></td>
</tr>

<tr>
<td class="org-left"><code>S</code></td>
<td class="org-left"><code>isolate-long-add</code></td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left"><code>isolate-quick-delete</code></td>
</tr>

<tr>
<td class="org-left"><code>D</code></td>
<td class="org-left"><code>isolate-long-delete</code></td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left"><code>isolate-quick-change</code></td>
</tr>

<tr>
<td class="org-left"><code>C</code></td>
<td class="org-left"><code>isolate-long-change</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left"><code>er/mark-defun</code> (select function point)</td>
</tr>

<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left"><code>er/mark-word</code> (select word at point)</td>
</tr>

<tr>
<td class="org-left"><code>W</code></td>
<td class="org-left"><code>er/mark-symbol</code> (select symbol at point)</td>
</tr>

<tr>
<td class="org-left"><code>P</code></td>
<td class="org-left"><code>mark-paragraph</code> (select paragraph at point)</td>
</tr>

<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left"><code>er/mark-inside-quotes</code> (select inside quote)</td>
</tr>

<tr>
<td class="org-left"><code>Q</code></td>
<td class="org-left"><code>er/mark-outside-quotes</code> (select including quote)</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left"><code>er/mark-inside-pairs</code> (select inside pair)</td>
</tr>

<tr>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>er/mark-outside-pairs</code> (selct including pair)</td>
</tr>
</tbody>
</table>

<p>
Some remarks:
</p>

<ol class="org-ol">
<li>I bind <code>C-y</code> to <code>yank</code> out side selection,
so <code>C-y</code> pastes when nothing is selected and copies when something is selected.</li>
<li><code>isolate-xxx</code> commands are from <a href="https://github.com/casouri/isolate">isolate.el</a>, basically <a href="https://github.com/emacs-evil/evil-surround/blob/master/readme.org">evil-surround</a> for vanilla Emacs.</li>
<li>marking commands are like Vim text objects, I normally start region with <code>set-mark-command</code>
and use these short cuts to select the text object that I want.</li>
</ol>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-11-15 Thu 00:00</p>
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2018-11-15 Thu 19:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
